////////////////////////////////////////////////////////////////////////
//文件名：FastMath.c                                                  //
//说明：FU68xx的数学库                                                //
//Log                                                                 //
//Timer         Writer      Thing                                 Ver //
//2016-10-11    Any         创建文件                              V1.0//
//2016-10-18    Any         去除延时函数                          V1.1//
//2016-10-19    Any         将DMP读取与检测分开                   V1.2//
//2016-10-24    Any         增加角速度读取                        V1.3//
//2016-10-24    Any         DMP数据读取只读四元数部分             V1.4//
//2016-11-01    Any         更新注释                              V1.5//
////////////////////////////////////////////////////////////////////////


#define q15 32768.0f

/**
 * 快速反正切浮点输出
 *
 * @Writer  Any
 * @Version V1.0
 * @Date    2016-11-01
 *
 * @param   yin        Y的值
 * @param   xin        X的值
 * @return             浮点型反正切值
 */
float fast_arctan2(short yin, short xin)
{
    return (fast_tan2(yin, xin) / q15);
}

/**
 * 快速反正切Q15输出
 *
 * @Writer  Any
 * @Version V1.0
 * @Date    2016-11-01
 *
 * @param   yin        Y的值
 * @param   xin        X的值
 * @return             Q15的反正切值
 */
unsigned short fast_arctan2(short yin, short xin)
{
    unsigned short data z;
    short data x[2], y[2];

    if (xin >= 0)
    {
        x[0] = xin;
        y[0] = yin;
        z = 0;
    }
    else if (yin >= 0)
    {
        x[0] = yin;
        y[0] = - xin;
        z = 16384;
    }
    else
    {
        x[0] = - yin;
        y[0] = xin;
        z = -16384;
    }

    if (y[0] < 0)
    {
        x[1] = x[0] - y[0];
        y[1] = y[0] + x[0];
        z -= 8192;
    }
    else
    {
        x[1] = x[0] + y[0];
        y[1] = y[0] - x[0];
        z += 8192;
    }

    if (y[1] < 0)
    {
        x[0] = x[1] - (y[1] >> 1);
        y[0] = y[1] + (x[1] >> 1);
        z -= 4836;
    }
    else
    {
        x[0] = x[1] + (y[1] >> 1);
        y[0] = y[1] - (x[1] >> 1);
        z += 4836;
    }

    if (y[0] < 0)
    {
        x[1] = x[0] - (y[0] >> 2);
        y[1] = y[0] + (x[0] >> 2);
        z -= 2555;
    }
    else
    {
        x[1] = x[0] + (y[0] >> 2);
        y[1] = y[0] - (x[0] >> 2);
        z += 2555;
    }

    if (y[1] < 0)
    {
        x[0] = x[1] - (y[1] >> 3);
        y[0] = y[1] + (x[1] >> 3);
        z -= 1297;
    }
    else
    {
        x[0] = x[1] + (y[1] >> 3);
        y[0] = y[1] - (x[1] >> 3);
        z += 1297;
    }

    if (y[0] < 0)
    {
        x[1] = x[0] - (y[0] >> 4);
        y[1] = y[0] + (x[0] >> 4);
        z -= 651;
    }
    else
    {
        x[1] = x[0] + (y[0] >> 4);
        y[1] = y[0] - (x[0] >> 4);
        z += 651;
    }

    if (y[1] < 0)
    {
        x[0] = x[1] - (y[1] >> 5);
        y[0] = y[1] + (x[1] >> 5);
        z -= 326;
    }
    else
    {
        x[0] = x[1] + (y[1] >> 5);
        y[0] = y[1] - (x[1] >> 5);
        z += 326;
    }

    if (y[0] < 0)
    {
        x[1] = x[0] - (y[0] >> 6);
        y[1] = y[0] + (x[0] >> 6);
        z -= 163;
    }
    else
    {
        x[1] = x[0] + (y[0] >> 6);
        y[1] = y[0] - (x[0] >> 6);
        z += 163;
    }

    if (y[1] < 0)
    {
        x[0] = x[1] - (y[1] >> 7);
        y[0] = y[1] + (x[1] >> 7);
        z -= 81;
    }
    else
    {
        x[0] = x[1] + (y[1] >> 7);
        y[0] = y[1] - (x[1] >> 7);
        z += 81;
    }

    if (y[0] < 0)
    {
        x[1] = x[0] - (y[0] >> 8);
        y[1] = y[0] + (x[0] >> 8);
        z -= 41;
    }
    else
    {
        x[1] = x[0] + (y[0] >> 8);
        y[1] = y[0] - (x[0] >> 8);
        z += 41;
    }

    if (y[1] < 0)
    {
        x[0] = x[1] - (y[1] >> 9);
        y[0] = y[1] + (x[1] >> 9);
        z -= 20;
    }
    else
    {
        x[0] = x[1] + (y[1] >> 9);
        y[0] = y[1] - (x[1] >> 9);
        z += 20;
    }

    if (y[0] < 0)
    {
        x[1] = x[0] - (y[0] >> 10);
        y[1] = y[0] + (x[0] >> 10);
        z -= 10;
    }
    else
    {
        x[1] = x[0] + (y[0] >> 10);
        y[1] = y[0] - (x[0] >> 10);
        z += 10;
    }

    if (y[1] < 0)
    {
        x[0] = x[1] - (y[1] >> 11);
        y[0] = y[1] + (x[1] >> 11);
        z -= 5;
    }
    else
    {
        x[0] = x[1] + (y[1] >> 11);
        y[0] = y[1] - (x[1] >> 11);
        z += 5;
    }

    if (y[0] < 0)
    {
        z -= 3;
    }
    else
    {
        z += 3;
    }

    return z;
}
